{
  "format": "layers-model",
  "generatedBy": "keras v2.1.6-tf",
  "convertedBy": "TensorFlow.js Converter v1.0.1",
  "modelTopology": {
    "training_config": {
      "sample_weight_mode": null,
      "optimizer_config": {
        "config": {
          "rho": 0.95,
          "epsilon": 1e-7,
          "lr": 1,
          "decay": 0
        },
        "class_name": "Adadelta"
      },
      "metrics": ["binary_accuracy"],
      "loss_weights": null,
      "weighted_metrics": null,
      "loss": "binary_crossentropy"
    },
    "backend": "tensorflow",
    "keras_version": "2.1.6-tf",
    "model_config": {
      "config": {
        "name": "model",
        "input_layers": [["input_1", 0, 0]],
        "layers": [
          {
            "config": {
              "sparse": false,
              "name": "input_1",
              "batch_input_shape": [null, 140, 140, 1],
              "dtype": "float32"
            },
            "name": "input_1",
            "class_name": "InputLayer",
            "inbound_nodes": []
          },
          {
            "config": {
              "name": "contracting_0_0_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 8,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "contracting_0_0_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["input_1", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "contracting_0_0_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "contracting_0_0_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["contracting_0_0_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "contracting_0_0_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "contracting_0_0_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["contracting_0_0_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "contracting_0_1_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 8,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "contracting_0_1_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["contracting_0_0_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "contracting_0_1_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "contracting_0_1_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["contracting_0_1_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "contracting_0_1_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "contracting_0_1_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["contracting_0_1_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "pool_size": [2, 2],
              "name": "contracting_0_pooling",
              "data_format": "channels_last",
              "padding": "valid",
              "trainable": true,
              "strides": [2, 2],
              "dtype": "float32"
            },
            "name": "contracting_0_pooling",
            "class_name": "MaxPooling2D",
            "inbound_nodes": [[["contracting_0_1_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "contracting_1_0_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 32,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "contracting_1_0_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["contracting_0_pooling", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "contracting_1_0_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "contracting_1_0_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["contracting_1_0_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "contracting_1_0_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "contracting_1_0_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["contracting_1_0_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "contracting_1_1_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 32,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "contracting_1_1_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["contracting_1_0_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "contracting_1_1_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "contracting_1_1_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["contracting_1_1_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "contracting_1_1_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "contracting_1_1_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["contracting_1_1_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "pool_size": [2, 2],
              "name": "contracting_1_pooling",
              "data_format": "channels_last",
              "padding": "valid",
              "trainable": true,
              "strides": [2, 2],
              "dtype": "float32"
            },
            "name": "contracting_1_pooling",
            "class_name": "MaxPooling2D",
            "inbound_nodes": [[["contracting_1_1_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "bottom_0_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 32,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "bottom_0_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["contracting_1_pooling", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "bottom_0_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "bottom_0_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["bottom_0_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "bottom_0_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "bottom_0_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["bottom_0_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "bottom_1_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 32,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "bottom_1_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["bottom_0_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "bottom_1_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "bottom_1_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["bottom_1_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "bottom_1_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "bottom_1_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["bottom_1_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_1_upsampling",
              "data_format": "channels_last",
              "size": [2, 2],
              "dtype": "float32"
            },
            "name": "expanding_1_upsampling",
            "class_name": "UpSampling2D",
            "inbound_nodes": [[["bottom_1_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "expanding_1_upsampling_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 16,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [1, 1],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "expanding_1_upsampling_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["expanding_1_upsampling", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "expanding_1_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "expanding_1_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["expanding_1_upsampling_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_1_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "expanding_1_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["expanding_1_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_1_cropping",
              "data_format": "channels_last",
              "dtype": "float32",
              "cropping": [[4, 4], [4, 4]]
            },
            "name": "expanding_1_cropping",
            "class_name": "Cropping2D",
            "inbound_nodes": [[["contracting_1_1_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "axis": -1,
              "trainable": true,
              "name": "concatenate",
              "dtype": "float32"
            },
            "name": "concatenate",
            "class_name": "Concatenate",
            "inbound_nodes": [[["expanding_1_relu", 0, 0, {}], ["expanding_1_cropping", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "expanding_1_0_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 16,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "expanding_1_0_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["concatenate", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "expanding_1_0_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "expanding_1_0_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["expanding_1_0_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_1_0_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "expanding_1_0_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["expanding_1_0_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "expanding_1_1_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 16,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "expanding_1_1_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["expanding_1_0_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "expanding_1_1_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "expanding_1_1_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["expanding_1_1_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_1_1_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "expanding_1_1_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["expanding_1_1_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_0_upsampling",
              "data_format": "channels_last",
              "size": [2, 2],
              "dtype": "float32"
            },
            "name": "expanding_0_upsampling",
            "class_name": "UpSampling2D",
            "inbound_nodes": [[["expanding_1_1_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "expanding_0_upsampling_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 8,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [1, 1],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "expanding_0_upsampling_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["expanding_0_upsampling", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "expanding_0_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "expanding_0_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["expanding_0_upsampling_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_0_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "expanding_0_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["expanding_0_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_0_cropping",
              "data_format": "channels_last",
              "dtype": "float32",
              "cropping": [[16, 16], [16, 16]]
            },
            "name": "expanding_0_cropping",
            "class_name": "Cropping2D",
            "inbound_nodes": [[["contracting_0_1_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "axis": -1,
              "trainable": true,
              "name": "concatenate_1",
              "dtype": "float32"
            },
            "name": "concatenate_1",
            "class_name": "Concatenate",
            "inbound_nodes": [[["expanding_0_relu", 0, 0, {}], ["expanding_0_cropping", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "expanding_0_0_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 8,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "expanding_0_0_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "expanding_0_0_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "expanding_0_0_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["expanding_0_0_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_0_0_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "expanding_0_0_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["expanding_0_0_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "expanding_0_1_conv",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 8,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [3, 3],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "expanding_0_1_conv",
            "class_name": "Conv2D",
            "inbound_nodes": [[["expanding_0_0_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "gamma_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "moving_variance_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Ones"
              },
              "center": true,
              "trainable": true,
              "epsilon": 0.001,
              "name": "expanding_0_1_bn",
              "beta_constraint": null,
              "gamma_regularizer": null,
              "beta_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "beta_regularizer": null,
              "axis": [3],
              "momentum": 0.99,
              "gamma_constraint": null,
              "dtype": "float32",
              "scale": true,
              "moving_mean_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              }
            },
            "name": "expanding_0_1_bn",
            "class_name": "BatchNormalization",
            "inbound_nodes": [[["expanding_0_1_conv", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "expanding_0_1_relu",
              "dtype": "float32",
              "activation": "relu"
            },
            "name": "expanding_0_1_relu",
            "class_name": "Activation",
            "inbound_nodes": [[["expanding_0_1_bn", 0, 0, {}]]]
          },
          {
            "config": {
              "name": "output_logit",
              "bias_initializer": {
                "config": {
                  "dtype": "float32"
                },
                "class_name": "Zeros"
              },
              "activity_regularizer": null,
              "filters": 1,
              "bias_constraint": null,
              "strides": [1, 1],
              "kernel_size": [1, 1],
              "activation": "linear",
              "padding": "valid",
              "kernel_regularizer": null,
              "data_format": "channels_last",
              "trainable": true,
              "bias_regularizer": null,
              "dilation_rate": [1, 1],
              "use_bias": true,
              "kernel_initializer": {
                "config": {
                  "dtype": "float32",
                  "seed": null
                },
                "class_name": "GlorotUniform"
              },
              "kernel_constraint": null,
              "dtype": "float32"
            },
            "name": "output_logit",
            "class_name": "Conv2D",
            "inbound_nodes": [[["expanding_0_1_relu", 0, 0, {}]]]
          },
          {
            "config": {
              "trainable": true,
              "name": "output_prob",
              "dtype": "float32",
              "activation": "sigmoid"
            },
            "name": "output_prob",
            "class_name": "Activation",
            "inbound_nodes": [[["output_logit", 0, 0, {}]]]
          }
        ],
        "output_layers": [["output_prob", 0, 0]]
      },
      "class_name": "Model"
    }
  },
  "weightsManifest": [
    {
      "weights": [
        {
          "name": "bottom_0_bn/gamma",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "bottom_0_bn/beta",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "bottom_0_bn/moving_mean",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "bottom_0_bn/moving_variance",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "bottom_0_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 32, 32]
        },
        {
          "name": "bottom_0_conv/bias",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "bottom_1_bn/gamma",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "bottom_1_bn/beta",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "bottom_1_bn/moving_mean",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "bottom_1_bn/moving_variance",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "bottom_1_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 32, 32]
        },
        {
          "name": "bottom_1_conv/bias",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_0_0_bn/gamma",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_0_0_bn/beta",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_0_0_bn/moving_mean",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_0_0_bn/moving_variance",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_0_0_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 1, 8]
        },
        {
          "name": "contracting_0_0_conv/bias",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_0_1_bn/gamma",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_0_1_bn/beta",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_0_1_bn/moving_mean",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_0_1_bn/moving_variance",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_0_1_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 8, 8]
        },
        {
          "name": "contracting_0_1_conv/bias",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "contracting_1_0_bn/gamma",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_1_0_bn/beta",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_1_0_bn/moving_mean",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_1_0_bn/moving_variance",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_1_0_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 8, 32]
        },
        {
          "name": "contracting_1_0_conv/bias",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_1_1_bn/gamma",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_1_1_bn/beta",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_1_1_bn/moving_mean",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_1_1_bn/moving_variance",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "contracting_1_1_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 32, 32]
        },
        {
          "name": "contracting_1_1_conv/bias",
          "dtype": "float32",
          "shape": [32]
        },
        {
          "name": "expanding_0_0_bn/gamma",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_0_bn/beta",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_0_bn/moving_mean",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_0_bn/moving_variance",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_0_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 16, 8]
        },
        {
          "name": "expanding_0_0_conv/bias",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_1_bn/gamma",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_1_bn/beta",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_1_bn/moving_mean",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_1_bn/moving_variance",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_1_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 8, 8]
        },
        {
          "name": "expanding_0_1_conv/bias",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_bn/gamma",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_bn/beta",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_bn/moving_mean",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_bn/moving_variance",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_0_upsampling_conv/kernel",
          "dtype": "float32",
          "shape": [1, 1, 16, 8]
        },
        {
          "name": "expanding_0_upsampling_conv/bias",
          "dtype": "float32",
          "shape": [8]
        },
        {
          "name": "expanding_1_0_bn/gamma",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_0_bn/beta",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_0_bn/moving_mean",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_0_bn/moving_variance",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_0_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 48, 16]
        },
        {
          "name": "expanding_1_0_conv/bias",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_1_bn/gamma",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_1_bn/beta",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_1_bn/moving_mean",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_1_bn/moving_variance",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_1_conv/kernel",
          "dtype": "float32",
          "shape": [3, 3, 16, 16]
        },
        {
          "name": "expanding_1_1_conv/bias",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_bn/gamma",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_bn/beta",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_bn/moving_mean",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_bn/moving_variance",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "expanding_1_upsampling_conv/kernel",
          "dtype": "float32",
          "shape": [1, 1, 32, 16]
        },
        {
          "name": "expanding_1_upsampling_conv/bias",
          "dtype": "float32",
          "shape": [16]
        },
        {
          "name": "output_logit/kernel",
